**FREE
DCL-DS PSDS PSDS QUALIFIED;
  ProcedureName *PROC;
  Status *STATUS;
  JobName CHAR(10) POS(244);
  UserName CHAR(10) POS(254);
  JobNo PACKED(6 :0) POS(264);
END-DS;
